fixtures/vcr_cassettes/ChartMogul_Import_CustomerInvoices/API_Interactions/correctly_interracts_with_the_API.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.chartmogul.com/v1/data_sources
    body:
      encoding: UTF-8
      string: '{"name":"Customer Invoices Test Data Source"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic YmIzN2I0Njk5NjNlMjhlYjY2MjA1ZWYzZmU1MWQ1NmM6ZmM1YjQxYzM3YTNlZTcwYjQyN2UwYzU1ODg2NzA2ZmQ=
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 22 Jun 2016 15:34:41 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"60451ca489b1142994522bdcd2a78022"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 14e68eba-6131-4b04-8210-d9901cadd7ef
      x-runtime:
      - '0.536866'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_9fb17361-f24c-4c13-a25d-4c08fbc7132e","name":"Customer
        Invoices Test Data Source","created_at":"2016-06-22T15:34:41.041Z","status":"never_imported"}'
    http_version:
  recorded_at: Wed, 22 Jun 2016 15:34:41 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"data_source_uuid":"ds_9fb17361-f24c-4c13-a25d-4c08fbc7132e","external_id":"test_cus_ext_id","name":"Test
        Customer","email":"test@customer.com","company":null,"country":"DE","state":null,"city":"Berlin","zip":null}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic YmIzN2I0Njk5NjNlMjhlYjY2MjA1ZWYzZmU1MWQ1NmM6ZmM1YjQxYzM3YTNlZTcwYjQyN2UwYzU1ODg2NzA2ZmQ=
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 22 Jun 2016 15:34:41 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"b207f005123ccc7fbe07e3cf8d4ef474"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 8b32a149-5c4a-4b14-a82f-666adaf3897a
      x-runtime:
      - '0.221606'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"uuid":"cus_5417b49e-7ea8-474a-b6bc-5bbb406c15c0","external_id":"test_cus_ext_id","name":"Test
        Customer","company":"","email":"test@customer.com","city":"Berlin","state":"","country":"DE","zip":"","data_source_uuid":"ds_9fb17361-f24c-4c13-a25d-4c08fbc7132e"}'
    http_version:
  recorded_at: Wed, 22 Jun 2016 15:34:41 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/plans
    body:
      encoding: UTF-8
      string: '{"data_source_uuid":"ds_9fb17361-f24c-4c13-a25d-4c08fbc7132e","name":"Test
        Plan","interval_count":7,"interval_unit":"day","external_id":"test_cus_pl_ext_id"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic YmIzN2I0Njk5NjNlMjhlYjY2MjA1ZWYzZmU1MWQ1NmM6ZmM1YjQxYzM3YTNlZTcwYjQyN2UwYzU1ODg2NzA2ZmQ=
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 22 Jun 2016 15:34:41 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"e804690c42c3d5f3d9301ff57fe9e918"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 9473bcf9-6970-4be8-a418-d2ae2988fa0c
      x-runtime:
      - '0.050208'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"uuid":"pl_209e4674-1258-4a35-8378-9b15c4086965","external_id":"test_cus_pl_ext_id","name":"Test
        Plan","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_9fb17361-f24c-4c13-a25d-4c08fbc7132e"}'
    http_version:
  recorded_at: Wed, 22 Jun 2016 15:34:41 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/import/customers/cus_5417b49e-7ea8-474a-b6bc-5bbb406c15c0/invoices
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic YmIzN2I0Njk5NjNlMjhlYjY2MjA1ZWYzZmU1MWQ1NmM6ZmM1YjQxYzM3YTNlZTcwYjQyN2UwYzU1ODg2NzA2ZmQ=
  response:
    status:
      code: 200
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 22 Jun 2016 16:08:43 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"cbb072e75866df2cb9be8bbdbd44920e"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 9d42e2ff-4066-4a90-99b4-b0999bdfeac6
      x-runtime:
      - '0.157408'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"customer_uuid":"cus_5417b49e-7ea8-474a-b6bc-5bbb406c15c0","invoices":[],"current_page":1,"total_pages":0}'
    http_version:
  recorded_at: Wed, 22 Jun 2016 16:08:43 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/customers/cus_5417b49e-7ea8-474a-b6bc-5bbb406c15c0/invoices
    body:
      encoding: UTF-8
      string: '{"invoices":[{"date":"2016-01-01 12:00:00 +0000","currency":"USD","line_items":[{"type":"subscription","subscription_external_id":"test_cus_sub_ext_id","plan_uuid":"pl_209e4674-1258-4a35-8378-9b15c4086965","service_period_start":"2016-01-01
        12:00:00 +0000","service_period_end":"2016-02-01 12:00:00 +0000","amount_in_cents":1000,"cancelled_at":"2016-01-15
        12:00:00 +0000","prorated":false,"quantity":5,"discount_amount_in_cents":1200,"discount_code":"DISCCODE","tax_amount_in_cents":200,"external_id":"test_cus_li_ext_id"}],"transactions":[{"type":"payment","date":"2016-01-01
        12:00:00 +0000","result":"successful","external_id":"test_cus_tr_ext_id"}],"external_id":"test_cus_inv_ext_id","due_date":"2016-01-07
        12:00:00 +0000"}],"customer_uuid":"cus_5417b49e-7ea8-474a-b6bc-5bbb406c15c0"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic YmIzN2I0Njk5NjNlMjhlYjY2MjA1ZWYzZmU1MWQ1NmM6ZmM1YjQxYzM3YTNlZTcwYjQyN2UwYzU1ODg2NzA2ZmQ=
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 22 Jun 2016 16:08:43 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"95e16111eb07645d2ab5af2f762cc1a7"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - fcadbbb4-8984-4938-97b3-151a3efae3ce
      x-runtime:
      - '0.182908'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"invoices":[{"uuid":"inv_a11675b0-f4cb-4d2b-8b38-492626ac373e","external_id":"test_cus_inv_ext_id","date":"2016-01-01T12:00:00.000Z","due_date":"2016-01-07T12:00:00.000Z","currency":"USD","line_items":[{"uuid":"li_6dc1a6bd-877d-4802-a595-4b0f5943bdfa","external_id":"test_cus_li_ext_id","type":"subscription","subscription_uuid":"sub_b39173f6-cd13-4c06-b6e6-0c659867439f","plan_uuid":"pl_209e4674-1258-4a35-8378-9b15c4086965","prorated":false,"service_period_start":"2016-01-01T12:00:00.000Z","service_period_end":"2016-02-01T12:00:00.000Z","amount_in_cents":1000,"quantity":5,"discount_code":"DISCCODE","discount_amount_in_cents":1200,"tax_amount_in_cents":200}],"transactions":[{"uuid":"tr_829db91c-8b46-48ac-805d-09d29afe64c2","external_id":"test_cus_tr_ext_id","type":"payment","date":"2016-01-01T12:00:00.000Z","result":"successful"}]}]}'
    http_version:
  recorded_at: Wed, 22 Jun 2016 16:08:43 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/data_sources/ds_9fb17361-f24c-4c13-a25d-4c08fbc7132e
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - Basic YmIzN2I0Njk5NjNlMjhlYjY2MjA1ZWYzZmU1MWQ1NmM6ZmM1YjQxYzM3YTNlZTcwYjQyN2UwYzU1ODg2NzA2ZmQ=
  response:
    status:
      code: 204
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 22 Jun 2016 16:08:43 GMT
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      cache-control:
      - no-cache
      x-request-id:
      - 5f2bcbf4-0c81-435f-b168-49a245d4e2c9
      x-runtime:
      - '0.018236'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Wed, 22 Jun 2016 16:08:43 GMT
recorded_with: VCR 3.0.3
